---
kind: property
id: P:Autodesk.Revit.DB.Parameter.Id
zh: 参数、共享参数
source: html/8da1bd1e-581b-1577-6a58-579e11e25f2f.htm
---
# Autodesk.Revit.DB.Parameter.Id Property

**中文**: 参数、共享参数

The id of the parameter.

## Syntax (C#)
```csharp
public ElementId Id { get; }
```